adafruit/seesaw/lib/samd09/atdf/ATSAMD09D14A.atdf
        <module name="NVMCTRL" id="U2207" version="1.0.7">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="ROW_PAGES" value="4"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0xC01FFFFFFFFFFFFF"/>
              <param name="FLASH_SIZE" value="16384"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="256"/>
              <param name="PAGES_PR_REGION" value="16"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2207" version="1.0.7">
          <instance name="FUSES">
            <register-group name="OTP4_FUSES" name-in-module="OTP4_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="PAC" id="U2211" version="1.0.1">
          <instance name="PAC0">
            <register-group name="PAC0" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000000"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
          <instance name="PAC1">
            <register-group name="PAC1" name-in-module="PAC" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000002"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
          <instance name="PAC2">
            <register-group name="PAC2" name-in-module="PAC" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00001000"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2206" version="2.1.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="RESET_N" pad="PA28"/>
            </signals>
            <parameters>
              <param name="CTRL_MCSEL_DFLL48M" value="3"/>
              <param name="CTRL_MCSEL_GCLK" value="0"/>
              <param name="CTRL_MCSEL_OSC8M" value="1"/>
              <param name="CTRL_MCSEL_XOSC" value="2"/>
              <param name="PM_CLK_APB_NUM" value="2"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="NVMCTRL" bit="4"/>
                <clock name="DMAC" bit="5"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="1.0.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41004400"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
            </signals>
            <parameters>
              <param name="BITS" value="32"/>
              <param name="DRVSTR" value="1"/>
              <param name="GROUPS" value="1"/>
              <param name="ODRAIN" value="0"/>
              <param name="SLEWLIM" value="0"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2202" version="1.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="ALARM_NUM" value="1"/>
              <param name="COMP16_NUM" value="2"/>
              <param name="COMP32_NUM" value="1"/>
              <param name="GCLK_ID" value="4"/>
              <param name="NUM_OF_ALARMS" value="1"/>
              <param name="NUM_OF_COMP16" value="2"/>
              <param name="NUM_OF_COMP32" value="1"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="2.0.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA14"/>
              <signal group="PAD" index="0" function="C" pad="PA06"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA15"/>
              <signal group="PAD" index="1" function="C" pad="PA07"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="D" pad="PA08"/>
              <signal group="PAD" index="2" function="C" pad="PA04"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="D" pad="PA09"/>
              <signal group="PAD" index="3" function="C" pad="PA05"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_CORE" value="14"/>
              <param name="GCLK_ID_SLOW" value="13"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="0" function="C" pad="PA30"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="1" function="C" pad="PA31"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA16"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="2" function="C" pad="PA08"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA17"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
              <signal group="PAD" index="3" function="C" pad="PA09"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_CORE" value="15"/>
              <param name="GCLK_ID_SLOW" value="13"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="SYSCTRL" id="U2100" version="2.0.2">
          <instance name="SYSCTRL">
            <register-group name="SYSCTRL" name-in-module="SYSCTRL" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="CAPLESS_EXTREF" function="VREG_TEST" pad="PA04"/>
              <signal group="CAPLESS_VDDCORE" function="VREG_TEST" pad="PA02"/>
              <signal group="ULPVREG_BODDETI" function="VREG_TEST" pad="PA06"/>
              <signal group="ULPVREG_BODDETII" function="VREG_TEST" pad="PA23"/>
              <signal group="ULPVREG_BODIEN" function="VREG_TEST" pad="PA03"/>
              <signal group="ULPVREG_BODIIEN" function="VREG_TEST" pad="PA05"/>
              <signal group="ULPVREG_ENABLE" function="VREG_TEST" pad="PA17"/>
              <signal group="ULPVREG_FORCELDO" function="VREG_TEST" pad="PA08"/>
              <signal group="ULPVREG_INC_BIAS" function="VREG_TEST" pad="PA11"/>
              <signal group="ULPVREG_LDOEN" function="VREG_TEST" pad="PA07"/>
              <signal group="ULPVREG_OSCEN" function="VREG_TEST" pad="PA22"/>
              <signal group="ULPVREG_REFRESH" function="VREG_TEST" pad="PA10"/>
              <signal group="ULPVREG_REFSEL" function="VREG_TEST" pad="PA16"/>
              <signal group="ULPVREG_REQBIAS" function="VREG_TEST" pad="PA09"/>
              <signal group="VREG_ENABLE" function="VREG_TEST" pad="PA24"/>
              <signal group="XIN" function="XIN" pad="PA08"/>
              <signal group="XIN32" function="XIN32" pad="PA08"/>
              <signal group="XOSC_CLK" function="XOSC_TEST" pad="PA15"/>
              <signal group="XOSC_EN" function="XOSC_TEST" pad="PA14"/>
              <signal group="XOUT32" function="XOUT32" pad="PA09"/>
            </signals>
            <parameters>
              <param name="BGAP_CALIB_MSB" value="11"/>
              <param name="BOD12_CALIB_MSB" value="4"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLL48" value="0"/>
              <param name="GCLK_ID_FDPLL" value="1"/>
              <param name="GCLK_ID_FDPLL32K" value="2"/>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="POR33_ENTEST_MSB" value="1"/>
              <param name="SYSTEM_CLOCK" value="1000000"/>
              <param name="ULPVREF_DIVLEV_MSB" value="3"/>
              <param name="ULPVREG_FORCEGAIN_MSB" value="1"/>
              <param name="ULPVREG_RAMREFSEL_MSB" value="2"/>
              <param name="VREF_CONTROL_MSB" value="48"/>
              <param name="VREF_STATUS_MSB" value="7"/>
              <param name="VREG_LEVEL_MSB" value="2"/>
              <param name="BOD12_VERSION" value="0x111"/>
              <param name="BOD33_VERSION" value="0x111"/>
              <param name="DFLL48M_VERSION" value="0x300"/>
              <param name="FDPLL_VERSION" value="0x110"/>
              <param name="OSCULP32K_VERSION" value="0x111"/>
              <param name="OSC8M_VERSION" value="0x120"/>
              <param name="OSC32K_VERSION" value="0x110"/>
              <param name="VREF_VERSION" value="0x201"/>
              <param name="VREG_VERSION" value="0x201"/>
              <param name="XOSC_VERSION" value="0x112"/>
              <param name="XOSC32K_VERSION" value="0x111"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2212" version="1.4.0">
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="GCLK_ID" value="18"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="GCLK_ID" value="18"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2203" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="GCLK_ID" value="3"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
